Tekla.Structures.Drawing.HatchLine
The HatchLine class defines a graphical object representing a line with definable width and hatch fill.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
PointList HatchLinePoints = new PointList();
HatchLinePoints.Add(new Point(10, 10));
HatchLinePoints.Add(new Point(200, 200));
DrawingObjectEnumerator myviews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(myviews.MoveNext())
{
HatchLine MyHatchLine = new HatchLine(myviews.Current as ViewBase, HatchLinePoints);
MyHatchLine.Attributes.Width = 10.0;
MyHatchLine.Attributes.ShowOuterLines = true;
MyHatchLine.Insert();
}
}
}
}

Tekla.Structures.Drawing.HatchLine.BaseLinePoints
The list of points for the hatch line.

Tekla.Structures.Drawing.HatchLine.Attributes
The attributes of the hatch line.

Tekla.Structures.Drawing.HatchLine.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.HatchLine.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.HatchLine.HatchLineAttributes)
Creates a new hatch line instance with a point list using the given attributes.
view: The view to be used.
pointList: The point list to be used.
attributes: The hatch line attributes to be used.

Tekla.Structures.Drawing.HatchLine.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new hatch line instance with a point list using standard attributes.
view: The view to be used.
pointList: The point list to be used.

Tekla.Structures.Drawing.HatchLine.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.HatchLine.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.HatchLine.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.HatchLine.Select
Calls the system to select and retrieve the object.
Returns: True on success.